Repository: w6rstian/Linguibuddy
Catalog: Linguibuddy/Resources/Strings/AppResources.*.resx
Languages: pl

# DictionarySearchFieldPlaceholder
source: Enter an English word
pl: Wpisz angielskie słowo

source: Dictionary
pl: Słownik

# Welcome
source: Welcome to Linguibuddy,
pl: Witaj w Linguibuddy,

# AddedToCollectionMessage
source: Added to: {0}
pl: Dodano do: {0}

source: Language
pl: Język

# LanguageName
source: English
pl: Polski

# NoResultsFoundText
source: No results found
pl: Nie znaleziono wyników

source: Collections
pl: Kolekcje

source: New collection
pl: Nowa kolekcja

source: Theme
pl: Motyw

# ThemeNameLight
source: Light
pl: Jasny

# ThemeNameDark
source: Dark
pl: Ciemny

source: Error
pl: Błąd

source: No translation
pl: Brak tłumaczenia

source: Save to
pl: Zapisz do

# SearchEmpty
source: Enter a word to search
pl: Wpisz słowo, aby wyszukać

# SelectCollectionError
source: Please select or create a collection (in collections tab) first.
pl: Wybierz lub stwórz kolekcję (w zakładce Kolekcje), aby zapisać słowo.

# SelectCollectionPlaceholder
source: Select collection
pl: Wybierz kolekcję

source: Success
pl: Sukces

source: Translate
pl: Przetłumacz

source: Translation error
pl: Błąd tłumaczenia

source: Learn
pl: Nauka

source: Edit
pl: Edytuj

# FlashcardsCount
source: flashcards
pl: fiszek

# NameEntry
source: Enter name:
pl: Podaj nazwę:

source: Congratulations!
pl: Gratulacje!

# LearningFinished
source: Learning session finished.
pl: Sesja nauki zakończona.

source: Back to list
pl: Wróć do listy

source: Tap to flip
pl: Kliknij, aby obrócić

source: I know
pl: Umiem

source: I don't know
pl: Nie umiem

source: Settings
pl: Ustawienia

source: Home
pl: Strona główna

source: Flashcards
pl: Fiszki

source: Audio error
pl: Błąd audio

source: Translation API
pl: API tłumaczące

source: Sign out
pl: Wyloguj

source: Minigames
pl: Lekcje

source: Achievements
pl: Osiągnięcia

# ChooseCollection
source: Choose a collection
pl: Wybierz kolekcję

source: Cancel
pl: Anuluj

# TooLittleWords
source: Not enough words in the collection to make a quiz.
pl: Za mało słów w kolekcji, by utworzyć quiz.

# CorrectAnswer
source: Awesome! It's the correct answer.
pl: Świetnie! To poprawna odpowiedź.

# IncorrectAnswer
source: Unfortunately, no. The correct answer is:
pl: Niestety. Prawidłowa odpowiedź to:

source: Network error
pl: Błąd sieci

# NetworkRequired
source: Network connection is required.
pl: Wymagane połączenie z siecią.

# NoSourceData
source: No source data for the word.
pl: Brak danych źródłowych słowa.

source: Translate before adding?
pl: Przetłumaczyć przed dodaniem?

source: Yes
pl: Tak

source: No
pl: Nie

source: Edit collection
pl: Edytuj kolekcję

source: Rename
pl: Zmień nazwę

source: Save
pl: Zapisz

source: Remove collection
pl: Usuń kolekcję

# RemoveCollectionDesc1
source: Are you sure you want to delete
pl: Czy na pewno chcesz usunąć

# RemoveCollectionDesc2
source: and all the words in it?
pl: i wszystkie słowa w niej?

# NoWordsInDatabase
source: No words in the database.
pl: Brak słów w bazie.

# FailedWordRetrieval
source: Failed to retrieve word
pl: Nie udało się pobrać słowa

source: VICTORY
pl: ZWYCIĘSTWO

source: The word is
pl: Słowo to

source: DEFEAT
pl: PORAŻKA

# FailedLoadQuestion
source: Failed to load the question
pl: Nie można załadować pytania

source: Perfect!
pl: Perfekcyjnie!

source: Error. Correct:
pl: Błąd. Poprawnie:

source: Next word
pl: Następne słowo

# Achievement10Name
source: Rookie Point Collector
pl: Początkujący Punktowicz

# NoAchievements
source: No achievements found.
pl: Brak osiągnięć do wyświetlenia.

# Achievement10Description
source: Get your first 100 points
pl: Zdobądź pierwsze 100 punktów

source: Hangman
pl: Wisielec

source: No flashcards to learn
pl: Brak fiszek do nauki

# CollectionEmpty
source: Collection is empty
pl: Kolekcja jest pusta

# SentenceGenerating
source: Sentence is generating...
pl: Generowanie zdania...

# SentenceRead
source: Read the sentence
pl: Przeczytaj zdanie

source: No permissions
pl: Brak uprawnień

# MicrophoneNeeded
source: We need access to a microphone
pl: Potrzebujemy dostępu do mikrofonu

source: Listening...
pl: Słucham...

# InstallEng
source: Install english language in Windows settings.
pl: Zainstaluj język angielski w ustawieniach Windows.

# OnlineSpeech
source: Enable 'Online Speech Recognition' in Windows settings.
pl: Włącz 'Rozpoznawanie mowy online' w ustawieniach Windows.

# AudioRecognize
source: Recognize audio
pl: Rozpoznaj audio

# AudioQuizDesc
source: Match the word to the sound
pl: Dopasuj słowo do dźwięku

# AudioClick
source: Click to listen
pl: Kliknij, aby odsłuchać

source: Next
pl: Dalej

source: Check
pl: Sprawdź

# CorrectAnswersCount
source: Correct answers:
pl: Poprawne odpowiedzi:

# PointsEarnedCount
source: Points earned:
pl: Zdobyte punkty:

# ImaqeQuizName
source: Match to picture
pl: Dopasuj do obrazka

# ImageQuizDesc
source: What do you see in the picture?
pl: Co widzisz na obrazku?

source: Profile
pl: Profil

# SentenceQuizName
source: Word order
pl: Szyk zdań

# SentenceQuizDesc
source: Arrange the words in the correct order
pl: Ułóż szyk zdania

source: Translate sentence:
pl: Przetłumacz zdanie:

# PreferredDifficulty
source: Preferred difficulty level
pl: Preferowany poziom trudności

source: Sign in
pl: Zaloguj

# SignInWelcome
source: Welcome! Sign in to continue
pl: Witaj! Zaloguj się, aby kontynuować

# SignInError
source: Email or password incorrect
pl: Nieprawidłowy adres e-mail lub hasło

# PlaybackError
source: The recording could not be played.
pl: Nie udało się odtworzyć nagrania.

source: Sign up
pl: Zarejestruj się

# SignUpPls
source: Need an account? Sign up
pl: Potrzebujesz konta? Zarejestruj się

# PasswordLength
source: Password must use 6 characters or more
pl: Hasło musi zawierać co najmniej 6 znaków

# SignInPls
source: Already have an account? Sign in
pl: Masz już konto? Zaloguj się

# SpeakingQuizName
source: Speaking
pl: Wymowa

# HangmanDesc
source: Hangman game
pl: Gra w wisielca

source: Listen
pl: Słuchaj

# PreferredMaxLessonLength
source: Preferred lesson length
pl: Preferowana długość lekcji

source: Database error
pl: Błąd bazy danych

# NoCollections
source: No collections found.
pl: Brak kolekcji do wyświetlenia.

source: Learning streak
pl: Seria nauki

source: Best
pl: Rekord

source: Points
pl: Punkty

# Achievement11Description
source: Get 500 points
pl: Zdobądź 500 punktów

# Achievement12Description
source: Get 1000 points
pl: Zdobądź 1000 punktów

# Achievement13Description
source: Get 2500 points
pl: Zdobądź 2500 punktów

# Achievement11Name
source: Apprentice of Pointology
pl: Adept Punktologii

# Achievement12Name
source: Journeyman of Points
pl: Czeladnik Punktów

# Achievement13Name
source: Seasoned Point Hunter
pl: Punktowy Wyjadacz

# Achievement14Name
source: Pointaholic
pl: Punktoholik

# Achievement15Name
source: Grandmaster of Applied Pointology
pl: Arcymistrz Punktologii Stosowanej

# Achievement14Description
source: Get 5000 points
pl: Zdobądź 5000 punktów

# Achievement15Description
source: Get 10000 points
pl: Zdobądź 10000 punktów

# Achievement20Description
source: Learn everyday for 3 days
pl: Ucz się codziennie przez 3 dni

# Achievement21Description
source: Learn everyday for 7 days
pl: Ucz się codziennie przez 7 dni

# Achievement22Description
source: Learn everyday for 14 days
pl: Ucz się codziennie przez 14 dni

# Achievement23Description
source: Learn everyday for 30 days
pl: Ucz się codziennie przez 30 dni

# Achievement20Name
source: First Steps
pl: Pierwsze Kroki

# Achievement21Name
source: A Week with No Excuses
pl: Tydzień Bez Wymówek

# Achievement22Name
source: Habit in the Making
pl: Nawyk w Budowie

# Achievement23Name
source: You've got the Rhythm
pl: Masz Już Rytm

source: Delete
pl: Usuń

# AITeacherBoxTitle
source: AI Insight
pl: Wnioski AI

# ItemExists
source: The word is already in the collection.
pl: Słowo już znajduje się w kolekcji.

source: Add to collection
pl: Dodaj do kolekcji

source: Details
pl: Szczegóły

source: Top Users
pl: Top Użytkownicy

# PointsAbbreviation
source: pts.
pl: pkt.

source: Leaderboard
pl: Ranking

# NoData
source: No data to show
pl: Brak danych do wyświetlenia

source: You did it!
pl: Udało ci się!

# TryHarder
source: You have to try harder.
pl: Musisz się bardziej postarać.

# Srs0
source: Total blackout
pl: Pustka

# Srs2
source: Feels familiar
pl: Kojarzę

# Srs4
source: Good
pl: Dobrze

# Srs5
source: Perfect
pl: Idealnie

# SpeakingQuizDesc
source: Say a sentence
pl: Wypowiedz zdanie

# LearningMode
source: Select learning mode
pl: Wybierz tryb nauki
